# **Week 02**

# 05 : Membalik Urutan Baris dan Kolom pada Data Frame

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.3
1.26.2

## Persiapan Data Frame

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  5  5  1  7
1  3  8  8  6  3
2  4  5  9  6  1
3  1  1  3  8  9
4  6  7  6  8  3

## Membalik Urutan Kolom

In [3]:
df.loc[:, ::-1]

   E  D  C  B  A
0  7  1  5  5  9
1  3  6  8  8  3
2  1  6  9  5  4
3  9  8  3  1  1
4  3  8  6  7  6

## Membalik Urutan Baris

In [4]:
df.loc[::-1]

   A  B  C  D  E
4  6  7  6  8  3
3  1  1  3  8  9
2  4  5  9  6  1
1  3  8  8  6  3
0  9  5  5  1  7

## Membalik Urutan Baris dan Melakukan Penyesuaian Ulang Index

In [6]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  7  6  8  3
1  1  1  3  8  9
2  4  5  9  6  1
3  3  8  8  6  3
4  9  5  5  1  7

# 06 : Mengganti Nama (label) Kolom pada Data Frame

## Persiapan Data Frame

In [7]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  5  5  9  3  2
1  3  2  5  4  4
2  4  1  1  8  4
3  9  6  9  9  9
4  3  3  1  3  7

## Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  5  5     9  3  2
1  3  2     5  4  4
2  4  1     1  8  4
3  9  6     9  9  9
4  3  3     1  3  7

## Mengganti nama (label) untuk banyak kolom pada Data Frame

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       5  9     3  2
1     3       2  5     4  4
2     4       1  1     8  4
3     9       6  9     9  9
4     3       3  1     3  7

# 07 : Menghapus (drop) Missing Values (NaN) pada Data Frame

## Persiapan Data Frame

In [13]:
import pandas as pd
import numpy as np

# Create a DataFrame with missing data
data = {'Z': np.random.rand(10), 'A': np.random.rand(10), 'B': np.random.rand(10), 'C': np.random.rand(10), 'D': np.random.rand(10)}
df = pd.DataFrame(data)

# Introduce some missing values
df.iloc[2:5, 0] = np.nan
df.iloc[7, 2] = np.nan

df.head()

          Z         A         B         C         D
0  0.306474  0.820605  0.840454  0.020691  0.252939
1  0.880578  0.801581  0.316938  0.090133  0.428298
2       NaN  0.779070  0.985426  0.638507  0.605529
3       NaN  0.364897  0.165445  0.067784  0.421570
4       NaN  0.298069  0.856851  0.394709  0.812836

In [15]:
df = df.rename(columns={'index':'Z'})
df.head()

          Z         A         B         C         D
0  0.306474  0.820605  0.840454  0.020691  0.252939
1  0.880578  0.801581  0.316938  0.090133  0.428298
2       NaN  0.779070  0.985426  0.638507  0.605529
3       NaN  0.364897  0.165445  0.067784  0.421570
4       NaN  0.298069  0.856851  0.394709  0.812836

In [17]:
df_backup = df.copy(deep=True)

In [18]:
df = df.dropna(axis='columns') 
df.head()

          A         C         D
0  0.820605  0.020691  0.252939
1  0.801581  0.090133  0.428298
2  0.779070  0.638507  0.605529
3  0.364897  0.067784  0.421570
4  0.298069  0.394709  0.812836

In [19]:
df = df_backup.copy(deep=True)

df = df.dropna(axis='rows') 

df.head()

          Z         A         B         C         D
0  0.306474  0.820605  0.840454  0.020691  0.252939
1  0.880578  0.801581  0.316938  0.090133  0.428298
5  0.086790  0.539864  0.143755  0.931278  0.084664
6  0.646740  0.723747  0.673517  0.230927  0.125900
8  0.957314  0.999491  0.038964  0.074635  0.121660

In [20]:
df = df_backup.copy(deep=True)

df.isna().mean()*100

Z    30.0
A     0.0
B    10.0
C     0.0
D     0.0
dtype: float64

In [21]:
treshold = len(df) * 0.9

df = df.dropna(thresh=treshold, axis='columns')
df.head()

          A         B         C         D
0  0.820605  0.840454  0.020691  0.252939
1  0.801581  0.316938  0.090133  0.428298
2  0.779070  0.985426  0.638507  0.605529
3  0.364897  0.165445  0.067784  0.421570
4  0.298069  0.856851  0.394709  0.812836

# 08 : Memeriksa Kesamaan Antar Dua Buah Kolom (Series) pada Data Frame

## Persiapan Data Frame

In [22]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

## Mengenal Pandas Series

In [23]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [24]:
type(df['A'])

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

## Memeriksa Kesamaan dengan Operator ==

In [26]:
df['A'] == df['B'] # operator == tidak dapat membandingkan nilai NaN dengan baik.

0     True
1     True
2     True
3    False
4     True
dtype: bool

## Memeriksa kesamaan dengan method equals()

In [27]:
df['A'].equals(df['B'])

True

## Memeriksa Kesamaan Antar Dua Data Frame

In [28]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [29]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True